/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   2903.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jaeelee <jaeelee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/09/03 02:15:43 by jaeelee           #+#    #+#             */
/*   Updated: 2021/09/03 02:33:57 by jaeelee          ###   ########seoul.kr  */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <math.h>

/**
 * @brief   사각형을 4등분으로 나누어갈 때 총 꼭짓점의 개수 구하는 문제이다.
 * @details 총 꼭짓점의 개수는 (2 ^ n + 1) ^ 2 이다.
 * @param   n : 사각형을 나눈 횟수 (1 <= n <= 15)
 * @return  총 꼭짓점의 개수
 */
int main()
{
    int n;

    scanf("%d", &n);
    printf("%d", (int)(pow(pow(2, n) + 1, 2)));
}